package com.trtm.sy.enumutil;

public enum MaterialType {
    土("TGJ", "土"),
    粗集料("CJL", "粗集料"),
    细集料("XJL", "细集料"),
    矿粉("KFJ", "矿粉"),
    岩石("YSJ", "岩石"),
    水泥("SNJ", "水泥"),
    水泥混凝土拌和物("TBH", "水泥混凝土拌和物"),
    硬化后水泥混凝土("TYH", "硬化后水泥混凝土"),
    水泥砂浆拌和物("SBH", "水泥砂浆拌和物"),
    硬化后水泥砂浆("SYH", "硬化后水泥砂浆"),
    水("SYJ", "水"),
    外加剂("WJJ", "外加剂"),
    石灰("SHJ", "石灰"),
    粉煤灰("FMH", "粉煤灰"),
    无机结合料稳定材料("WJL", "无机结合料稳定材料"),
    沥青("LQJ", "沥青"),
    沥青混合料("LQL", "沥青混合料"),
    钢材与连接接头("GJJ", "钢材与连接接头"),
    土工合成材料("HCJ", "土工合成材料"),
    路基路面("XCJ", "路基路面"),
    水泥混凝土配合比("TPB", "水泥混凝土配合比"),
    水泥砂浆配合比("SPB", "水泥砂浆配合比"),
    无机结合料稳定材料配合比("WPB", "无机结合料稳定材料配合比"),
    沥青混合料配合比("QPB", "沥青混合料配合比"),
    矿质混合料配合比("KPB", "矿质混合料配合比"),
    混凝土结构("JGT", "混凝土结构"),
    桥梁结构("QLJ", "桥梁结构"),
    基坑地基与基桩("DJJ", "基坑、地基与基桩"),
    钢绞线("GJX", "钢绞线"),
    锚具夹具连接器("MJJ", "锚具、夹具、连接器"),
    桥梁支座("ZZJ", "桥梁支座"),
    桥梁伸缩装置("SSF", "桥梁伸缩装置（伸缩缝）"),
    波纹管("BWG", "波纹管"),
    钢结构("GJG", "钢结构"),
    隧道("SDJ", "隧道"),
    交通安全设施("JAJ", "交通安全设施"),
    掺和料("CHL", "掺和料"),
    木质素聚合物矿物纤维("MXW", "木质素、聚合物、矿物纤维"),
    压浆材料("YJL", "压浆材料"),
    防水材料("FSJ", "防水材料"),
    抗滑材料("KHJ", "抗滑材料"),
    钢纤维("GXW", "钢纤维"),
    透水管("TSG", "透水管"),
    锚杆拉拔力("LBJ", "锚杆拉拔力"),
    房屋检测("FJJ", "房屋检测"),
    监测类("JCJ", "监测类"),
    砖("QZJ", "砖"),
    轻集料("QJL", "轻集料"),
    管材("GCJ", "管材"),
    压浆净浆灌浆泥浆材料("GJL", "压浆、净浆、灌浆、泥浆材料"),
    岩石制品("YZP", "岩石制品"),
    轨道("GDJ", "轨道"),
    钢丝("GSJ", "钢丝"),
    水泥净浆配合比("JPB", "水泥净浆配合比"),
    密封胶("MFJ", "密封胶"),
    电线电缆("DXJ", "电线电缆"),
    井盖("JGJ", "井盖"),
    栏杆护栏("LGJ", "栏杆、护栏"),
    胶结料("JJL", "胶结料"),
    石材("SCJ", "石材"),
    混凝土预制构件("YZJ", "混凝土预制构件"),
    通信管道("TXJ", "通信管道"),
    绝热材料("JRJ", "绝热材料"),
    纤维增强复合材料拉索("CFJ", "纤维增强复合材料拉索"),
    安装施工工程("AZG", "安装施工工程"),
    砌块("QKJ", "砌块"),
    预应力用钢材("YYLYGC", "预应力用钢材");

    private final String code;
    private final String materialName;

    MaterialType(String code, String materialName) {
        this.code = code;
        this.materialName = materialName;
    }

    public String getCode() {
        return code;
    }

    public String getMaterialName() {
        return materialName;
    }
}
